a = int(input("Введите год рождения:  "))
b = input("Введите месяц:  ")
c = int(input("Введите день :  "))
z = ["овен", "телец", "близнецы", "рак", "лев", "дева", "весы",
     "скорпион", "стрелец", "козерог", "водолей", "рыбы"]
x = 2020-a
if b == "январь" and c >= 21 or b == "февраль" and c <= 20:
    print("Вам" + " " + str(x), "и вы" + " " + z[10])
if b == "февраль" and c >= 21 or b == "март" and c <= 20:
    print("Вам" + " " + str(x), "и вы" + " " + z[11])
if b == "март" and c >= 21 or b == "апрель" and c <= 20:
    print("Вам" + " " + str(x), "и вы" + " " + z[0])
if b == "апрель" and c >= 21 or b == "май" and c <= 20:
    print("Вам" + " " + str(x), "и вы" + " " + z[1])
if b == "май" and c >= 21 or b == "июнь" and c <= 21:
    print("Вам" + " " + str(x), "и вы" + " " + z[2])
if b == "июнь" and c >= 22 or b == "июль" and c <= 22:
    print("Вам" + " " + str(x), "и вы" + " " + z[3])
if b == "июль" and c >= 23 or b == "август" and c <= 23:
    print("Вам" + " " + str(x), "и вы" + " " + z[4])
if b == "август" and c >= 24 or b == "сентябрь" and c <= 23:
    print("Вам" + " " + str(x), "и вы" + " " + z[5])
if b == "сентябрь" and c >= 24 or b == "октябрь" and c <= 23:
    print("Вам" + " " + str(x), "и вы" + " " + z[6])
if b == "октябрь" and c >= 24 or b == "ноябрь" and c <= 22:
    print("Вам" + " " + str(x), "и вы" + " " + z[7])
if b == "ноябрь" and c >= 23 or b == "декабрь" and c <= 21:
    print("Вам" + " " + str(x), "и вы" + " " + z[8])
if b == "декабрь" and c >= 22 or b == "январь" and c <= 20:
    print("Вам" + " " + str(x), "и вы" + " " + z[9])
